# HorizontalAlignment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..HorizontalAlignment Property
TextNode Class See Also
---
Indicates default horizontal alignment of the text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public HorizontalTextAlignment HorizontalAlignment { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HorizontalAlignment As HorizontalTextAlignment
	Get
```

Visual C++
---
```text
public:
property HorizontalTextAlignment HorizontalAlignment {
	HorizontalTextAlignment get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace